dot-misc.org
#+TITLE:Dot Emacs:  Miscellaneous
#+AUTHOR: Brad Collins
#+EMAIL: brad@chenla.la
#+PROPERTY: header-args    :results drawer  :tangle emacs-misc.el

* Introduction

This is an odd collection of functions that I have found or written
myself to do little trivial but useful things.


* Insert Stuff

Various functions to insert things.

Use this from the documentation as a cheat sheet for formating things.

#+begin_src emacs-lisp :tangle no
;; %:a  weekday name: `Monday'.		%#A gives uppercase: `MONDAY'
;; %3a  abbreviated weekday: `Mon'.	%3A gives uppercase: `MON'
;; %:b  month name: `January'.		%#B gives uppercase: `JANUARY'
;; %3b  abbreviated month: `Jan'.	%3B gives uppercase: `JAN'
;; %02d day of month
;; %02H 24-hour clock hour
;; %02I 12-hour clock hour
;; %02m month number
;; %02M minute
;; %#p  `am' or `pm'.			%P  gives uppercase: `AM' or `PM'
;; %02S seconds
;; %w   day number of week, Sunday is 0
;; %02y 2-digit year: `97'		%:y 4-digit year: `1997'
;; %z   time zone name: `est'.		%Z  gives uppercase: `EST'

;; Non-date items:
;; %%   a literal percent character: `%'
;; %f   file name without directory	%F  gives absolute pathname
;; %s   system name
;; %u   user's login name		%U  user's full name
;; %h   mail host name
#+end_src


** defun insert-stuff

Written long before Hydra and heavily used for a few years.

Will eventually turn this into a Hydra

#+begin_src emacs-lisp

;; Insert Stuff ============================================

(defun insert-stuff (name)
  (interactive "cInsert (D)ate,(E)mail,(I)SO,(N)ame,(F)ilename,(L)oc,(B)XID,(U)UID,(W)iki-note,(T)asks, Fix U(R)L")
  (insert (cond ((equal name ?d)(format-time-string "%3b-%m-%Y"))
		((equal name ?e)(insert-email-address))
		((equal name ?i)(format-time-string "%Y-%02m-%02dT%02H:%02M"))
		((equal name ?n)(concat user-full-name " <" 
                  user-mail-address ">"))
		((equal name ?f)(format "%s" (buffer-name)))
		((equal name ?l)(concat (capitalize user-work-location-name)
                                   " (" user-work-latitude " " 
                                   user-work-longitude ")"))
                 
                 ((equal name ?b)(insert-bxid))
                 ((equal name ?u)(uuid)) 
                 ((equal name ?w)(format-time-string "notes-%Y-%m-%d"))
                 ((equal name ?t) (planner-authority-task-template))
                 ((equal name ?r) (burr-replace-url))
		(t ((equal name ?i)(format-time-string "%Y-%02m-%02dT%02H:%02M"))))))
(global-set-key [f1] 'insert-stuff)

#+end_src



** =========================================================

#+begin_src emacs-lisp



;; Inserts the date in the format 
(defun insert-email-address ()
  "Insert `user-email-address' at point."
  (interactive)
  (insert user-mail-address))

;; Inserts the date in the format 
(defun insert-iso ()
  "Insert date at point."
  (interactive)
  (insert (format-time-string "%Y-%02m-%02dT%02H:%02M")))

;; Inserts the date in the format 
(defun insert-date ()
  "Insert date at point."
  (interactive)
       (insert (format-time-string "%d.%m.%Y %H:%M")))

;; Inserts Unix Time

(defun insert-unix ()
  "Insert unix time at point."
  (interactive)
  (insert (format "%s" (float-time)))
  )

;; Insert Sig file of choice

(defun signature (name)
  (interactive "cSig: (M)ailing List Studio(J)ungle, (C)henla, (D)eerpig, (S)tandard")
  (goto-char (point-max))
  (insert "\n")
  (insert-file (cond ((equal name ?e) "~/brad_stuff/emacs.sig")
		     ((equal name ?j) "~/brad_stuff/studiojungle.sig")
		     ((equal name ?c) "~/brad_stuff/chenla.sig")
		     ((equal name ?d) "~/brad_stuff/deerpig.sig")
		     ((equal name ?d) "~/brad_stuff/mail-list.sig")
		     (t "~/brad_stuff/standard.sig"))))
;;(global-set-key [f2] 'signature)


;; Function to insert a commented seperator line: 
;;

(defun insert-comment-heading (comment)
  "Insert COMMENT, followed by \" ---...\".  The line will be
  commented based on which mode you are in." 
  (interactive "sComment: ")
  (insert  comment " " (make-string (- (window-width)
                                       (+ (length comment) 5)
                                       10)
                                    ?-))
  (comment-region (point-at-bol) (point-at-eol))
  (newline))
#+end_src
